[
{ "descripcion": "Seleccionar todos los extintores de una ubicación específica." },
{ "descripcion": "Listar todos los extintores junto con su tipo." },
{ "descripcion": "Mostrar la capacidad y fecha de vencimiento de cada extintor." },
{ "descripcion": "Listar los tipos de extintores y la cantidad de extintores disponibles para cada tipo." },
{ "descripcion": "Obtener los extintores que necesitan recarga en el próximo mes." },
{ "descripcion": "Contar cuántos extintores hay en cada ubicación de la institución." },
{ "descripcion": "Mostrar todas las ubicaciones que tienen más de un tipo de extintor." },
{ "descripcion": "Listar los extintores que han expirado." },
{ "descripcion": "ncontrar los extintores con una capacidad mayor a 10 libras." },
{ "descripcion": "Mostrar las fechas de carga y vencimiento de los extintores en una ubicación dada." },
{ "descripcion": "Listar todos los extintores cuya fecha de vencimiento sea anterior a la fecha actual." },
{ "descripcion": "Mostrar los extintores por tipo y su respectiva ubicación." },
{ "descripcion": "Obtener detalles de los extintores asignados a los laboratorios." },
{ "descripcion": "Listar los extintores que no han sido recargados en los últimos dos años." },
{ "descripcion": "Mostrar un resumen de extintores por tipo y su promedio de capacidad." },
{ "descripcion": "Obtener la lista de todos los extintores y su información de ubicación y tipo." },
{ "descripcion": "Listar los extintores que tienen una capacidad específica y su correspondiente ubicación." },
{ "descripcion": "Mostrar el número de extintores por cada tipo que están asignados a cada ubicación." },
{ "descripcion": "Encontrar las ubicaciones que tienen más de un tipo de extintor." },
{ "descripcion": "Mostrar todos los extintores que están por vencer en los próximos tres meses junto con su ubicación y tipo." },
{ "descripcion": "Identificar las ubicaciones donde todos los extintores tienen una fecha de carga dentro del último año." },
{ "descripcion": "Listar todos los extintores que han sido recargados en un rango de fechas específico junto con su tipo y ubicación." },
{ "descripcion": "Contar cuántos extintores de cada tipo existen en las diferentes ubicaciones de la institución." },
{ "descripcion": "Encontrar las ubicaciones que no tienen extintores asignados." },
{ "descripcion": "Listar los extintores que necesitan recarga y no están en oficinas." },
{ "descripcion": "Mostrar los extintores con una capacidad superior a un valor específico, incluyendo su ubicación y tipo." },
{ "descripcion": "Encontrar los extintores que fueron instalados en un año específico, agrupados por tipo y ubicación." },
{ "descripcion": "Listar los tipos de extintores que nunca han sido usados en ciertas ubicaciones." },
{ "descripcion": "Mostrar los extintores cuya fecha de vencimiento haya pasado, agrupados por tipo y ubicación." },
{ "descripcion": "Listar los extintores que están en las ubicaciones que comienzan con una letra específica." },
{ "descripcion": "Obtener un listado de extintores según la longitud de su ubicación específica." },
{ "descripcion": "Identificar extintores que están asignados a ubicaciones con más de tres extintores del mismo tipo." },
{ "descripcion": "Listar los extintores que tienen fechas de carga y vencimiento dentro de un intervalo específico." },
{ "descripcion": "Mostrar un resumen de la cantidad de extintores por tipo en cada ubicación, para ubicaciones con más de tres extintores." },
{ "descripcion": "Listar los tipos de extintores más frecuentes en las principales ubicaciones de la institución." },
{ "descripcion": "Encontrar ubicaciones específicas que tengan extintores de una capacidad mínima determinada." },
{ "descripcion": "Mostrar los extintores que están ubicados en áreas destinadas exclusivamente para emergencias." },
{ "descripcion": "Identificar extintores de ciertos tipos que están colocados en áreas restringidas de la institución." },
{ "descripcion": "Listar extintores por la antigüedad de su última recarga, incluyendo tipo y ubicación." },
{ "descripcion": "Mostrar un conteo de extintores que están en ubicaciones que terminan con una vocal." },
{ "descripcion": "Encontrar extintores cuyas fechas de vencimiento y de carga caigan dentro de los meses de verano." },
{ "descripcion": "Listar los extintores que han sido movidos de una ubicación a otra dentro de un período específico." },
{ "descripcion": "Mostrar los extintores que requieren mantenimiento urgente, agrupados por ubicación y tipo." },
{ "descripcion": "Identificar ubicaciones que requieren más extintores de ciertos tipos según las normas de seguridad." },
{ "descripcion": "Mostrar la cantidad de extintores por ubicación que tienen un tipo de agente extinguidor específico." }
]
